In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [5]:
df# it shows list of columns. Each of columns are pandas sereies

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
df['W']
print(type(df['W']))

<class 'pandas.core.series.Series'>

In [7]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [8]:
df['M'] = (df['W']+df['Z'])

In [9]:
df

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [10]:
## deleting the column
df.drop('M',axis=1,inplace=True),#axis = 0 for drop methods refers to rows. 
# If we want ot acces column axis =1.
#inplace = True. Set it to True to delete columns permanantly

(None,)

In [11]:
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

## Selecting the specific rows and columns

In [12]:
print(df.loc['A'])
print(df.iloc[2]) #selecting row 'C'

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64
W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [13]:
df.loc['B','Y'] #Value at row B and column y

-0.8480769834036315

In [14]:
df.loc[:,['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

# DataFrame Part 2

In [15]:
print('df>0\n',df>0)
booldf = df>0 
print('\n\nbooldf\n',df[booldf]) #it gives NAN wherever value is false

df>0
        W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True


booldf
           W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [18]:
resultdf = df[df['W']>0]
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [20]:
#reuturn X columns where W is no negetive
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [21]:
df[(df['W']>0) & (df['Y']>1)]
# we cannot use df[(df['W']>0) and (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df[(df['W']>0) | (df['Y']>1)]
# we cannot use df[(df['W']>0) or (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Resetimg index

In [23]:
# df.reset_index()
# df

In [24]:
newind = 'CA Ny WY OR CO'.split()
newind

['CA', 'Ny', 'WY', 'OR', 'CO']

In [25]:
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     Ny
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [26]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
Ny      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# DataFrame Part 3

In [39]:
#index level
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [40]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [41]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [42]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1 -1.467514 -0.494095
   2 -0.162535  0.485809
   3  0.392489  0.221491
G2 1 -0.855196  1.541990
   2  0.666319 -0.538235
   3 -0.568581  1.407338

In [43]:
df.loc['G1']

          A         B
1 -1.467514 -0.494095
2 -0.162535  0.485809
3  0.392489  0.221491

In [58]:
df.loc['G1'].loc[1]

A   -1.467514
B   -0.494095
Name: 1, dtype: float64

In [52]:
df.iloc[:,[0]]

             A
G1 1 -1.467514
   2 -0.162535
   3  0.392489
G2 1 -0.855196
   2  0.666319
   3 -0.568581

In [61]:
df.index.names = ['Groups','Num']

In [62]:
df

                   A         B
Groups Num
G1     1   -1.467514 -0.494095
       2   -0.162535  0.485809
       3    0.392489  0.221491
G2     1   -0.855196  1.541990
       2    0.666319 -0.538235
       3   -0.568581  1.407338

In [74]:
df.loc['G2'].loc[2]['B']

-0.5382346255173922

In [79]:
df.iloc[4,1]

-0.5382346255173922

In [81]:
df.xs(1,level='Num')

               A         B
Groups
G1     -1.467514 -0.494095
G2     -0.855196  1.541990

In [ ]:
! git add Dataframe.ipynb
! git commit -m "15:42/04-06-2021"
! git push origin main